Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoUptoRoofForWall { get; }
  Visual Basic
Public Shared ReadOnly Property NoUptoRoofForWall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoUptoRoofForWall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallJoinRoofFailures Class
  Autodesk.Revit.DB Namespace